# تمرین 5
# c = [12, 23, 454, 23, 12, 1, 23, 4, 45, 6, 7, 8, 45, 2, 12]

# از لیست بالا مقدارهایی که کمتر از 10 هست را داخل یک لیست جدید ذخیره کن و پرینت کن در نهایت
# c = [12, 23, 454, 23, 12, 1, 23, 4, 45, 6, 7, 8, 45, 2, 12]
# d = []
# for ggg in c :
#     if ggg < 10 :
#          d.append(ggg)
            
# print(d)

# تمرین 6 :
# عدد مورد علاقت رو داخل یک وریبل بنویس
# بعدش از یوزر یک عدد بگیر با اینپوت و چک کن عددی که داده با عدد تو یکی هست یا نه

# ooo = 10
# kk = input("Enter your number : ")
# print(type(kk))

# gh = int(kk)
# print(gh)
# print(type(gh))

# if gh == ooo :
#     print("OK")

# else:
#     print("no")