# تمرین 3

# یک لیست با جی پی تی تولید کن از اعداد بین 0 تا 20 به تعداد 5 تا و شرط های زیر را بررسی کند برای تک تک آیتم ها

# اگر عدد بین 20 تا 18 بود و 18 هم شامل شود پرینت کند عالی
# اگر بین 18 تا 15 بود بنویسد متوسط و 15 هم شامل شود
# اگر 15 تا 10 بود بنویسد خوب نیست و 10 هم شامل شود
# اگر کمتر از 10 بود بنویسد مردود

numbers = [12, 11, 4, 23, 12, 23, 6, 23, 1, 19, "asd", "Asdasd", True]

numbers.append(False)
print(numbers)

# for var_i in numbers:

#     if var_i < 20 and var_i >= 18:
#         print("عالی")
#     elif var_i < 18 and var_i >= 15:
#         print("متوسط")
#     elif var_i < 10:
#         print("مردود")
